2025-05-13 22:18:35,161 - INFO - APP.py - Line: 40 - APP返回信息:1,10.0,203.1,790.3,167.8,9.5,53.5,-23.4,-150.6,773.6,175.8,-14.2,-59.8
2025-05-13 22:18:35,161 - INFO - APP.py - Line: 104 - pose_param_list:[]
2025-05-13 22:18:35,164 - INFO - APP.py - Line: 161 - AGILE_left机器人坐标1:[-1.0, 473.0, -94.0, -0.644, 0.45, 125.374] -- 相机坐标转为机器人坐标
2025-05-13 22:18:35,164 - INFO - APP.py - Line: 162 - AGILE_right机器人坐标1:[394.0, 474.0, 252.0, -0.915, 0.175, 125.235] -- 相机坐标转为机器人坐标
2025-05-13 22:18:35,164 - INFO - APP.py - Line: 161 - AGILE_left机器人坐标2:[35.0, 135.0, 10.0, 0.181, -0.379, -119.876] -- 相机坐标转为机器人坐标
2025-05-13 22:18:35,164 - INFO - APP.py - Line: 162 - AGILE_right机器人坐标2:[429.0, 135.0, 354.0, 0.044, -0.018, -120.013] -- 相机坐标转为机器人坐标
2025-05-13 22:18:35,165 - INFO - Function.py - Line: 530 - 使用right_arm抓取
2025-05-13 22:18:35,165 - DEBUG - selector_events.py - Line: 54 - Using selector: EpollSelector
2025-05-13 22:18:35,166 - INFO - Function.py - Line: 675 - left_arm:抓取点rz变为 35.37,放置点rz变为 0
2025-05-13 22:18:35,167 - INFO - Function.py - Line: 675 - right_arm:抓取点rz变为 35.24,放置点rz变为 0